package G20200343030375;

import java.util.HashSet;
import java.util.Set;




/**
 * 模仿 StefanPochmann（斯蒂芬）的，看着挺漂亮的，可是效率惨不忍睹
 */
public class LeetCode_36_375 {
    public static void main(String args[]){

        char[][] array =new char[][]{
          {'5', '3', '.', '.', '7', '.', '.', '.', '.'},
          {'6', '.', '.', '1', '9', '5', '.', '.', '.'},
          {'.', '9', '8', '.', '.', '.', '.', '6', '.'},
          {'8', '.', '.', '.', '6', '.', '.', '.', '3'},
          {'4', '.', '.', '8', '.', '3', '.', '.', '1'},
          {'7', '.', '.', '.', '2', '.', '.', '.', '6'},
          {'.', '6', '.', '.', '.', '.', '2', '8', '.'},
          {'.', '.', '.', '4', '1', '9', '.', '.', '5'},
          {'.', '.', '.', '.', '8', '.', '.', '7', '9'}
        };



        char[][] array2 =new char[][]{
           {'8', '3', '.', '.', '7', '.', '.', '.', '.'},
           {'6', '.', '.', '1', '9', '5', '.', '.', '.'},
           {'.', '9', '8', '.', '.', '.', '.', '6', '.'},
           {'8', '.', '.', '.', '6', '.', '.', '.', '3'},
           {'4', '.', '.', '8', '.', '3', '.', '.', '1'},
           {'7', '.', '.', '.', '2', '.', '.', '.', '6'},
           {'.', '6', '.', '.', '.', '.', '2', '8', '.'},
           {'.', '.', '.', '4', '1', '9', '.', '.', '5'},
           {'.', '.', '.', '.', '8', '.', '.', '7', '9'}
        };


        System.out.println( LeetCode_36_375.isValidSudoku(array));
        System.out.println( LeetCode_36_375.isValidSudoku(array2));
    }

    public static boolean isValidSudoku(char[][] board) {

        Set<String> set = new HashSet<>();

        for(int i =0 ;i< 9 ;++i){
            for(int j = 0; j<9 ; ++j){
                if (board[i][j] != '.')
                    if( !set.add(board[i][j]+ " r " +i)
                            ||!set.add(board[i][j] + " c " + j)
                            ||!set.add(board[i][j]+" "+ i/3+"-" + j/3)
                            )
                        return false;
            }
        }
        return true;
    }
}
